#include <revolution.h>

#include <private/ipc.h>

#include <private/ios.h>

#include <private/fs.h>

#include <string.h>
#include <stddef.h>

static IOSFd        __fsFd = -1;
static u32          __fsInitialized = FALSE;

static char*        __devfs = NULL;

static IOSHeapId    hId;

static s32          _asynCnt = 0;

enum {
    ISFS_CB_STATE_NONE = 0,
    ISFS_CB_STATE_GET_STATS,
    ISFS_CB_STATE_READ_DIR,
    ISFS_CB_STATE_GET_ATTR,
    ISFS_CB_STATE_GET_USAGE,
    ISFS_CB_STATE_GET_FILE_STATS
};

enum {
    ISFS_IOCTL_GET_STATS        = 2,
    ISFS_IOCTL_CREATE_DIR       = 3,
    ISFS_IOCTL_READ_DIR         = 4,
    ISFS_IOCTL_SET_ATTR         = 5,
    ISFS_IOCTL_GET_ATTR         = 6,
    ISFS_IOCTL_DELETE_PATH      = 7,
    ISFS_IOCTL_RENAME_PATH      = 8,
    ISFS_IOCTL_CREATE_FILE      = 9,
    ISFS_IOCTL_GET_FILE_STATS   = 11,
    ISFS_IOCTLV_GET_USAGE       = 12,
    ISFS_IOCTL_SHUTDOWN_FS      = 13
};

typedef struct FS_GetAttr {
    u32* ownerId;   // 0x00
    u16* groupId;   // 0x04
    u32* attr;      // 0x08
    u32* ownerAcc;  // 0x0C
    u32* groupAcc;  // 0x10
    u32* othersAcc; // 0x14
} FS_GetAttr;

typedef struct FS_GetUsage {
    u32* blocks;    // 0x00
    u32* iNodes;    // 0x04
} FS_GetUsage;

typedef struct FS_Callback {
    u8              ioBuf[0x100] ALIGN32;   // 0x00
    ISFSCallback    callback;               // 0x100
    void*           callbackArg;            // 0x104
    u32             func;                   // 0x108

    union {
        ISFSStats*      stats;
        ISFSFileStats*  fstats;

        u32*            num;

        FS_GetAttr      getAttr;
        FS_GetUsage     getUsage;
    } args;                                 // 0x10C
} FS_Callback;

#define FS_HEAP_BLOCK   16
#define FS_HEAP_SIZE    ((FS_HEAP_BLOCK+1) * OSRoundUp32B(sizeof(FS_Callback)))

#define FS_ALLOC(p)     iosAllocAligned(hId, sizeof(*p), DEFAULT_ALIGN)
#define FS_FREE(p)      if (p != NULL) { iosFree(hId, p); }

ISFSError ISFS_OpenLib() {
    ISFSError       ret = ISFS_ERROR_OK;

    static void*    lo = NULL;
    static void*    hi = NULL;

    FS_Callback*    __fsCtxt = NULL;

    if (!__fsInitialized) {
        lo = IPCGetBufferLo();
        hi = IPCGetBufferHi();
    }

    __devfs = (char*)OSRoundUp32B(lo);
    if (!__fsInitialized && ((u32)__devfs + OSRoundUp32B(FS_MAX_PATH)) > (u32)hi) {
        OSReport("APP ERROR: Not enough IPC arena\n");
