#ifndef IPL_SYSTEM_H
#define IPL_SYSTEM_H

#include "config.h"

#include <decomp.h>

#include <revolution.h>
#include <private/sc.h>

#include <nw4r/ut.h>

#include <egg/core.h>

#include "system/iplFramework.h"
#include "system/iplException.h"
#include "system/iplNandManager.h"
#include "system/iplController.h"
#include "system/iplErrorHandler.h"
#include "system/iplResetHandler.h"
#include "system/iplWarningHandler.h"
#include "system/iplDialogWindow.h"
#include "system/iplPointer.h"
#include "system/iplHomeButton.h"
#include "system/iplTVRCManager.h"
#include "system/iplChannelManager.h"
#include "system/iplChannelScriptManager.h"
#include "system/iplMessageManager.h"
#include "system/iplSaveDataManager.h"
#include "system/iplKeyboard.h"
#include "system/iplNwc24Manager.h"
#include "system/iplPostmanManager.h"
#include "system/iplNigaoeManager.h"
#include "system/iplBS2Manager.h"
#include "system/iplCdbManager.h"
#include "scene/iplSceneManager.h"
#include "utility/iplJpegDecoder.h"
#include "utility/iplCalendar.h"

#include <eztx.h>

/**
 * @brief Log the result to the NAND log. (`shared2/test2/nanderr.log`)
 * @param type The error type as a string
 * @param result The result
 * @param line The line number
 */
#define IPLErrorLog(type, result, line) ipl::System::getErrorHandler()->log(type, result, __FILE__, line)
/**
 * @brief Display the error screen.
 * @param msgId The Message ID (`iplErrorHandler.h` has the list of available IDs)
 */
#define IPLErrorDisplay(msgId)          ipl::System::getErrorHandler()->set(ipl::ErrorHandler::DEFAULT, msgId)
/**
 * @brief Display the warning dialog.
 * @param msgId The Message ID.
 */
#define IPLWarnDisplay(msgId)           ipl::System::getWarningHandler()->set(ipl::WarningHandler::DEFAULT, msgId)
/**
 * @brief Display the warning dialog and then reset.
 * @param msgId The Message ID.
 */
#define IPLWarnDisplayAndReset(msgId)   ipl::System::getWarningHandler()->set(ipl::WarningHandler::RESET, msgId)
/**
 * @brief Log the result to the NAND log. (`shared2/test2/nanderr.log`) and then displays error screen.
 * @param msgId The Message ID (`iplErrorHandler.h` has the list of available IDs)
 * @param type The error type as a string
 * @param result The result
 * @param line The line number
 */
#define IPLErrorLogAndDisplay(msgId, type, result, line) {  \
    IPLErrorLog(type, result, line);                        \
    IPLErrorDisplay(msgId);                                 \
}

namespace ipl {
    class System {
        public:
            enum {
                LAUNCH_CODE_SETTING = 1,
                LAUNCH_CODE_DATA_MANAGER = 2,
            };
            class Arg {
                public:
                    Arg();

                private:
                    EGG::Heap*                      mpMem1Root;                 // 0x00
                    EGG::Heap*                      mpMem2Root;                 // 0x04
                    EGG::Heap*                      mpMem1Sys;                  // 0x08
                    EGG::Heap*                      mpMem2Sys;                  // 0x0C
                    EGG::Heap*                      mpSceneHeap;                // 0x10
                    EGG::Heap*                      mpSoundHeap;                // 0x14
                    EGG::Heap*                      mpChannelHeap;              // 0x18
                    void*                           unk_0x1C;
                    EGG::Heap*                      mpSharedHeap;               // 0x20
                    EGG::Heap*                      mpMem1App;                  // 0x24
                    EGG::Heap*                      mpMem2App;                  // 0x28
                    EGG::Heap*                      mpTreasureHeap;             // 0x2C
                    void*                           mpChannelArena;             // 0x30
                    EGG::Heap*                      mpFontHeap;                 // 0x34
                    EGG::Heap*                      mpMailHeap;                 // 0x38

                    OSCalendarTime                  mCurrentTime;               // 0x3C

                    scene::Manager*                 mpSceneManager;             // 0x64
                    controller::Manager*            mpControllerManager;        // 0x68
                    nand::Manager*                  mpNandManager;              // 0x6C
                    nigaoe::Manager*                mpMiiManager;               // 0x70
                    Framework*                      mpFramework;                // 0x74
                    Exception*                      mpException;                // 0x78
                    cdb::Manager*                   mpCdbManager;               // 0x7C
                    message::Manager*               mpMessageMgr;               // 0x80
                    channel::Manager*               mpChannelManager;           // 0x84
                    channel::ChannelScriptManager*  mpChannelScriptManager;     // 0x88
                    nwc24::Manager*                 mpNwc24Manager;             // 0x8C
                    keyboard::Manager*              mpKeyboardMgr;              // 0x90
                    savedata::Manager*              mpSaveDataManager;          // 0x94
                    ErrorHandler*                   mpErrorHandler;             // 0x98
                    ResetHandler*                   mpResetHandler;             // 0x9C
                    WarningHandler*                 mpWarningHandler;           // 0xA0
                    postman::Manager*               mpPostmanManager;           // 0xA4
                    bs2::Manager*                   mpBS2Manager;               // 0xA8
                    DialogWindow*                   mpDialog;                   // 0xAC
                    Pointer*                        mpPointer;                  // 0xB0
                    HomeButtonMenu*                 mpHomeButton;               // 0xB4
                    TVRCManager*                    mpTVRCManager;              // 0xB8
                    utility::JpegDecoder*           mpJpegDecoder;              // 0xBC
                    EGG::Thread*                    mpMainThread;               // 0xC0
                    EGG::ColorFader*                mpFader;                    // 0xC4
                    EGG::ColorFader*                mpResetFader;               // 0xC8
                    math::Random*                   mpRandom;                   // 0xCC

                    EGG::TaskThread*                mpTask1;                    // 0xD0
                    EGG::TaskThread*                mpTask2;                    // 0xD4
                    EGG::TaskThread*                mpTask3;                    // 0xD8
    
                    nw4r::ut::Font*                 mpWBFont1Data;              // 0xDC
                    nand::SharedFile*               mpWBF1File;                 // 0xE0
                    nw4r::ut::Font*                 mpWBFont2Data;              // 0xE4
                    nand::SharedFile*               mpWBF2File;                 // 0xE8

                    enum {
                        FONT,
                        RSO_SYM_LIST,
                        SOUND,
                        SOFT_KEYBOARD,
                        RES_4, // unused
                        FACE,
                        HBM_LAYOUT,
                        HBM_LANG,
                        HBM_LANG_JPN = HBM_LANG,
                        HBM_LANG_ENG,
                        HBM_LANG_GER,
                        HBM_LANG_FRA,
                        HBM_LANG_SPA,
                        HBM_LANG_ITA,
                        HBM_LANG_NED,
                        HBM_LANG_CHN,
                        HBM_LANG_CHN_TRAD, // unused
                        HBM_LANG_KOR,
                        MESSAGES,
                        MESG_ENG = MESSAGES,
                        MESG_FRA,
                        MESG_GER,
                        MESG_ITA,
                        MESG_JPN,
                        MESG_NED,
                        MESG_SPA,
                        MESG_CHN,
                        MESG_CHN_TRAD, // unused
                        MESG_KOR,
                        RES_27, // unused
                        HBM_MESSAGE,
                        HBM_CONFIG,
                        HBM_SPEAKER_SOUND,
                        HBM_BAN_ICON,
                        RES_32, // unused
                        RES_33, // unused
                        RES_34, // unused
                        ZI_DICT,
                        NINTENDO_DICT,
                        INVALID_JPEG,
                        RES_38, // unused
                        RES_39, // unused
                        DIALOG_WINDOW,
                        MAX_RES
                    };

                    union {
                        nand::File*             file[MAX_RES];
                        nand::SharedFile*       sharedFile[MAX_RES];
                        nand::LayoutFile*       layoutFile[MAX_RES];
                    } mResources;                                       // 0xEC

                    union {
                        struct {
                            u8* sys[EZTX_LANG_MAX];
                            u8* oem[EZTX_LANG_MAX];
                        };
                        u8* all[EZTX_LANG_MAX * 2];
                    } mZiDicData;                                       // 0x190

                    OSAlarm                 mUnusedAlarm;               // 0x1E0

                    void*                   mpFontArena;                // 0x210
                    void*                   mpMem1Arena;                // 0x214
                    u32                     mMem1ArenaSize;             // 0x218

                    u32                     mBS2BootType;               // 0x21C
                    u32                     mBS2LaunchCode;             // 0x220
                    u32                     unk_0x224;
                    char*                   mpNetSettingArg;            // 0x228
                    char*                   mpDataManageArg;            // 0x22C
                    char                    mBS2FirstArgv[128];         // 0x230

                    volatile bool           mbResLoaded;                // 0x2B0
                    bool                    mbInitCreateAfter;          // 0x2B1
                    volatile bool           mbCreatedAfter;             // 0x2B2
                    bool                    mbLibraryInit;              // 0x2B3
                    bool                    mbCreatedLibMgr;            // 0x2B4
                    bool                    unused_0x2B5;
                    volatile bool           mbFontResLoaded;            // 0x2B6
                    volatile bool           mbSndResLoaded;             // 0x2B7
                    volatile bool           mbZi8ResLoaded;             // 0x2B8
                    volatile bool           mbNeedToCreateFolders;      // 0x2B9
                    volatile bool           mbFoldersCreated;           // 0x2BA
                    volatile bool           mbIsNandFull;               // 0x2BB
                    volatile bool           mbSafeMode;                 // 0x2BC
                    bool                    unk_0x2BD;
                    volatile bool           mbRequestCreateAfter;       // 0x2BE
                    bool                    mbRequestCreateLibMgr;      // 0x2BF

                    enum {
                        REGIST_STATE_START = 0,
                        REGIST_STATE_DOING,
                        REGIST_STATE_END,
                    };

                    vs32                    mRegistState;               // 0x2C0
                    vs32                    mRegistErrCode;             // 0x2C4
                    volatile bool           mbGoingToDataManager;       // 0x2C8
                    u8                      unk_0x2CC[0x2D0 - 0x2CC];
                    ESTitleId               mBS2LaunchTitle;            // 0x2B0

                friend class System;
            };
            
            /*==============================*/
            /*           THREADING          */
            /*==============================*/
            
            static EGG::Thread*                     getMainThread()             { return smArg.mpMainThread; }
            static EGG::TaskThread*                 getTask1()                  { return smArg.mpTask1; }
            static EGG::TaskThread*                 getTask2()                  { return smArg.mpTask2; }
            static EGG::TaskThread*                 getTask3()                  { return smArg.mpTask3; }

            /*==============================*/
            /*         MEMORY HEAP          */
            /*==============================*/

            static EGG::Heap*                       createMem1AppHeap();
